cf/Documents/PersonnelChange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>PersonnelChange</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OperationKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OperationKindsPersonnelChange</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Changes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Position</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Positions</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StartDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/OperationKindsPersonnelChange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>OperationKindsPersonnelChange</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Hiring</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PositionChanging</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dismissal</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/PersonnelChange/Forms/DocumentForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Month = "January 2024";
	
EndProcedure

&AtClient
Procedure ChangesEmployeeOnChange(Item)
	
	CurrentData = Items.Changes.CurrentData;
	
	If ValueIsFilled(CurrentData.Employee) And Not EmployeeIsOldEnough(CurrentData.Employee, Object.Date) Then
		CurrentData.Employee = Undefined;
		MessageText = StrTemplate(
			"Employee %1 is under 16 years old on a document's date. You can't hire him",
			CurrentData.Employee
		);
		Message(MessageText);
	EndIf;
	
EndProcedure

&AtServerNoContext
Function EmployeeIsOldEnough(Employee, Date)

	DateOfBirth = Employee.DateOfBirth;
	
	Return DateOfBirth <= AddMonth(Date, -16 * 12);
	
EndFunction

&AtClient
Procedure ChangesEmployeeStartChoice(Item, ChoiceData, StandardProcessing)
	
	If Object.OperationKind = PredefinedValue("Enum.OperationKindsPersonnelChange.Dismissal") Then
		StandardProcessing = False;
		
		OpenParameters = New Structure("Filter", New Structure("Date, Company", Object.Date, Object.Company));
		
		OpenForm("Catalog.Employees.Form.WorkingEmployees", OpenParameters, Item);
	EndIf;

	//FillChoiceData(ChoiceData);

EndProcedure

&AtServerNoContext
Procedure FillChoiceData(ChoiceData)

	ChoiceData = New ValueList;
	Selection = Catalogs.Employees.Select();
	Counter = 0;
	While Selection.Next() Do
		Counter = Counter + 1;
		NewElement = ChoiceData.Add(Selection.Ref, Selection.Description);
	EndDo;
	
EndProcedure
